RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/mcal-gen/SysconfigGeneratedDpl/AM62Px.syscfg
gpio17.$name                   = "DI_BL_FAULT";
gpio17.useMcuDomainPeripherals = false;
gpio17.GPIO.$assign            = "GPIO0";
gpio17.GPIO.gpioPin.$assign    = "VOUT0_DATA8";

gpio18.$name                   = "DI_SOC_FPDLINK3_LOCK";
gpio18.useMcuDomainPeripherals = false;
gpio18.GPIO.$assign            = "GPIO0";
gpio18.GPIO.gpioPin.$assign    = "MMC2_DAT2";

gpio19.$name                   = "DI_SOC_FPDLINK3_PASS";
gpio19.useMcuDomainPeripherals = false;
gpio19.GPIO.$assign            = "GPIO0";
gpio19.GPIO.gpioPin.$assign    = "MMC2_CLK";

gpio20.$name                   = "DI_ENET_MII_INT";
gpio20.useMcuDomainPeripherals = false;
gpio20.GPIO.$assign            = "GPIO0";
gpio20.GPIO.gpioPin.$assign    = "RGMII2_TD0";

gpio21.$name                   = "DI_IGN_MON";
gpio21.useMcuDomainPeripherals = false;
gpio21.GPIO.$assign            = "GPIO0";
gpio21.GPIO.gpioPin.$assign    = "RGMII2_TD1";

gpio22.$name                   = "DI_CABLE_DETECT";
gpio22.useMcuDomainPeripherals = false;
gpio22.GPIO.$assign            = "GPIO1";
gpio22.GPIO.gpioPin.$assign    = "RGMII2_RX_CTL";

gpio23.$name                   = "DI_TCON_IND_OUT";
gpio23.useMcuDomainPeripherals = false;
gpio23.GPIO.$assign            = "GPIO1";
gpio23.GPIO.gpioPin.$assign    = "MCASP0_ACLKX";

gpio24.$name                   = "DI_SPI_CAN_TCON_SDI";
gpio24.useMcuDomainPeripherals = false;
gpio24.GPIO.$assign            = "GPIO1";
gpio24.GPIO.gpioPin.$assign    = "SPI0_D1";

gpio25.$name                   = "DI_MCU_FALD_CONN_CHK";
gpio25.useMcuDomainPeripherals = false;
gpio25.GPIO.$assign            = "GPIO1";
gpio25.GPIO.gpioPin.$assign    = "RGMII2_RD0";

gpio26.$name                   = "DI_LDO_1V2_FAULTN";
gpio26.useMcuDomainPeripherals = false;
gpio26.GPIO.$assign            = "GPIO1";
gpio26.GPIO.gpioPin.$assign    = "RGMII2_RD1";

gpio27.$name                   = "DI_TFT_ER_DET";
gpio27.useMcuDomainPeripherals = false;
gpio27.GPIO.$assign            = "GPIO1";
gpio27.GPIO.gpioPin.$assign    = "MMC1_SDCD";

gpio28.$name                    = "DO_MCU_RESETSTAZ";
gpio28.pinDir                   = "OUTPUT";
gpio28.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio28.MCU_GPIO.gpioPin.$assign = "MCU_RESETSTATz";

gpio29.$name                   = "DO_VPP_EN";
gpio29.pinDir                  = "OUTPUT";
gpio29.useMcuDomainPeripherals = false;
gpio29.GPIO.$assign            = "GPIO0";
gpio29.GPIO.gpioPin.rx         = false;
gpio29.GPIO.gpioPin.$assign    = "VOUT0_DATA2";

gpio30.$name                   = "DO_MD_GNSS_BOOT_EN";
gpio30.pinDir                  = "OUTPUT";
gpio30.useMcuDomainPeripherals = false;
gpio30.GPIO.$assign            = "GPIO0";
gpio30.GPIO.gpioPin.rx         = false;
gpio30.GPIO.gpioPin.$assign    = "VOUT0_DATA3";

gpio31.$name                   = "DO_MD_GNSS_RESETP";
gpio31.pinDir                  = "OUTPUT";
gpio31.useMcuDomainPeripherals = false;
gpio31.GPIO.$assign            = "GPIO0";
gpio31.GPIO.gpioPin.rx         = false;
gpio31.GPIO.gpioPin.$assign    = "VOUT0_DATA5";

gpio32.$name                   = "DO_MD_GNSS_PWR_EN";
gpio32.pinDir                  = "OUTPUT";
gpio32.useMcuDomainPeripherals = false;
gpio32.GPIO.$assign            = "GPIO0";
gpio32.GPIO.gpioPin.rx         = false;
gpio32.GPIO.gpioPin.$assign    = "VOUT0_DATA6";

gpio33.$name                   = "DO_BLU_OPAMP_PWR_EN";
gpio33.pinDir                  = "OUTPUT";
gpio33.useMcuDomainPeripherals = false;
gpio33.GPIO.$assign            = "GPIO0";
gpio33.GPIO.gpioPin.rx         = false;
gpio33.GPIO.gpioPin.$assign    = "VOUT0_DATA9";

gpio34.$name                   = "DO_BLU_DWALED_EN";
gpio34.pinDir                  = "OUTPUT";
gpio34.useMcuDomainPeripherals = false;
gpio34.GPIO.gpioPin.rx         = false;
gpio34.GPIO.gpioPin.$assign    = "VOUT0_DATA15";

gpio35.$name                   = "DO_TCON_BYPASS_MODE";
gpio35.pinDir                  = "OUTPUT";
gpio35.useMcuDomainPeripherals = false;
gpio35.GPIO.$assign            = "GPIO0";
gpio35.GPIO.gpioPin.rx         = false;
gpio35.GPIO.gpioPin.$assign    = "VOUT0_HSYNC";

gpio36.$name                   = "DO_TCON_BYPASS_SEL0";
gpio36.pinDir                  = "OUTPUT";
gpio36.useMcuDomainPeripherals = false;
gpio36.GPIO.$assign            = "GPIO0";
gpio36.GPIO.gpioPin.rx         = false;
gpio36.GPIO.gpioPin.$assign    = "VOUT0_DE";

gpio37.$name                   = "DO_TCON_BYPASS_SEL1";
gpio37.pinDir                  = "OUTPUT";
gpio37.useMcuDomainPeripherals = false;
gpio37.GPIO.$assign            = "GPIO0";
gpio37.GPIO.gpioPin.rx         = false;
gpio37.GPIO.gpioPin.$assign    = "VOUT0_VSYNC";

gpio38.$name                   = "DO_SOC_FPDLINK3_PDB";
gpio38.pinDir                  = "OUTPUT";
gpio38.useMcuDomainPeripherals = false;
gpio38.GPIO.$assign            = "GPIO0";
gpio38.GPIO.gpioPin.rx         = false;
gpio38.GPIO.gpioPin.$assign    = "MMC2_DAT1";

gpio39.$name                   = "DO_SOC_FPDLINK3_INTB";
gpio39.pinDir                  = "OUTPUT";
gpio39.useMcuDomainPeripherals = false;
gpio39.GPIO.$assign            = "GPIO0";
gpio39.GPIO.gpioPin.rx         = false;
gpio39.GPIO.gpioPin.$assign    = "MMC2_DAT0";

gpio40.$name                   = "DO_SOC_FPDLINK3_BISTEN";
gpio40.pinDir                  = "OUTPUT";
gpio40.useMcuDomainPeripherals = false;
gpio40.GPIO.$assign            = "GPIO0";
gpio40.GPIO.gpioPin.rx         = false;
gpio40.GPIO.gpioPin.$assign    = "MMC2_CMD";

gpio41.pinDir                  = "OUTPUT";
gpio41.useMcuDomainPeripherals = false;
gpio41.$name                   = "DO_EN_BUCK_FALD";
gpio41.GPIO.$assign            = "GPIO1";
gpio41.GPIO.gpioPin.rx         = false;

gpio42.$name                   = "DO_MCU_AMUX_S1";
gpio42.useMcuDomainPeripherals = false;
gpio42.pinDir                  = "OUTPUT";
gpio42.GPIO.$assign            = "GPIO1";
gpio42.GPIO.gpioPin.rx         = false;
gpio42.GPIO.gpioPin.$assign    = "MCASP0_AFSX";

gpio43.$name                   = "DO_MCU_AMUX_S0";
gpio43.pinDir                  = "OUTPUT";
gpio43.useMcuDomainPeripherals = false;
gpio43.GPIO.$assign            = "GPIO1";
gpio43.GPIO.gpioPin.rx         = false;
gpio43.GPIO.gpioPin.$assign    = "MCASP0_AFSR";

gpio44.$name                   = "DO_TCON_SPI0_CS0";
gpio44.pinDir                  = "OUTPUT";
gpio44.useMcuDomainPeripherals = false;
gpio44.GPIO.$assign            = "GPIO1";
gpio44.GPIO.gpioPin.rx         = false;
gpio44.GPIO.gpioPin.$assign    = "SPI0_CS0";

