RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/mcal-gen/SysconfigGeneratedDpl/AM62Px.syscfg
gpio45.$name                   = "DO_SPI_CAN_CS";
gpio45.pinDir                  = "OUTPUT";
gpio45.useMcuDomainPeripherals = false;
gpio45.GPIO.$assign            = "GPIO1";
gpio45.GPIO.gpioPin.rx         = false;
gpio45.GPIO.gpioPin.$assign    = "SPI0_CS1";

gpio46.$name                   = "DESER_SPI1_DO";
gpio46.pinDir                  = "OUTPUT";
gpio46.useMcuDomainPeripherals = false;
gpio46.GPIO.$assign            = "GPIO1";
gpio46.GPIO.gpioPin.rx         = false;
gpio46.GPIO.gpioPin.$assign    = "MMC1_DAT3";

gpio47.$name                   = "DO_SOC_TCON_GRBN";
gpio47.pinDir                  = "OUTPUT";
gpio47.useMcuDomainPeripherals = false;
gpio47.GPIO.$assign            = "GPIO1";
gpio47.GPIO.gpioPin.rx         = false;
gpio47.GPIO.gpioPin.$assign    = "MMC1_DAT1";

gpio48.$name                   = "DO_TFT_CSB";
gpio48.pinDir                  = "OUTPUT";
gpio48.useMcuDomainPeripherals = false;
gpio48.GPIO.$assign            = "GPIO1";
gpio48.GPIO.gpioPin.rx         = false;
gpio48.GPIO.gpioPin.$assign    = "MMC1_SDWP";

gpio49.$name                    = "DO_TFT_BL_EN";
gpio49.pinDir                   = "OUTPUT";
gpio49.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio49.MCU_GPIO.gpioPin.rx      = false;
gpio49.MCU_GPIO.gpioPin.$assign = "WKUP_CLKOUT0";

gpio50.$name = "CONFIG_GPIO1";

gpio51.$name                    = "CONFIG_GPIO2";
gpio51.MCU_GPIO.gpioPin.rx      = false;
gpio51.MCU_GPIO.gpioPin.$assign = "WKUP_I2C0_SCL";

gpio52.$name                    = "CONFIG_GPIO3";
gpio52.MCU_GPIO.gpioPin.$assign = "MCU_MCAN1_TX";

gpio53.$name                   = "CONFIG_GPIO0";
gpio53.useMcuDomainPeripherals = false;
gpio53.pinDir                  = "OUTPUT";
gpio53.GPIO.gpioPin.rx         = false;
gpio53.GPIO.gpioPin.$assign    = "RGMII2_TX_CTL";

gpio54.$name                   = "CONFIG_GPIO4";
gpio54.useMcuDomainPeripherals = false;
gpio54.pinDir                  = "OUTPUT";
gpio54.GPIO.gpioPin.rx         = false;
gpio54.GPIO.gpioPin.$assign    = "RGMII2_TD2";

gpio55.$name                   = "AMP_SHUTDOWN";
gpio55.pinDir                  = "OUTPUT";
gpio55.useMcuDomainPeripherals = false;
gpio55.GPIO.gpioPin.rx         = false;
gpio55.GPIO.gpioPin.$assign    = "GPMC0_BE1n";

i2c1.$name               = "CONFIG_I2C0";
i2c1.MCU_I2C.$assign     = "MCU_I2C0";
i2c1.MCU_I2C.SCL.$assign = "MCU_I2C0_SCL";
i2c1.MCU_I2C.SDA.$assign = "MCU_I2C0_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

i2c2.$name                   = "CONFIG_I2C1";
i2c2.useMcuDomainPeripherals = false;
i2c2.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template1";
i2c2.I2C.$assign             = "I2C3";
i2c2.I2C.SCL.$assign         = "UART0_CTSn";
i2c2.I2C.SDA.$assign         = "UART0_RTSn";

i2c3.$name                   = "DAC_I2C";
i2c3.useMcuDomainPeripherals = false;
i2c3.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template2";
i2c3.I2C.$assign             = "I2C1";
i2c3.I2C.SCL.pu_pd           = "nopull";
i2c3.I2C.SCL.$assign         = "I2C1_SCL";
i2c3.I2C.SDA.pu_pd           = "nopull";
i2c3.I2C.SDA.$assign         = "I2C1_SDA";

mcasp1.$name                                   = "E40_CHIMES";
mcasp1.enableLoopback                          = false;
mcasp1.txDataMask                              = 0xFFFFFFFF;
mcasp1.txActiveSlotMask                        = 0x3;
mcasp1.txCallbackFxn                           = "mcasp_txcb";
mcasp1.externTxLoopjob                         = true;
mcasp1.txLoopjobBufExtern                      = "unsigned int audio_sample[]";
mcasp1.txLoopjobBuf                            = "audio_sample";
mcasp1.txLoopjobBufLength                      = 384000;
mcasp1.enableMcaspRx                           = false;
mcasp1.mcaspSer.create(1);
mcasp1.mcaspSer[0].$name                       = "CONFIG_MCASP_SER0";
mcasp1.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP1";
mcasp1.mcaspSer[0].MCASP.AXR0.$assign          = "GPMC0_WEn";
mcasp1.MCASP.$assignAllowConflicts             = "MCASP1";
mcasp1.MCASP.AFSX.$assign                      = "GPMC0_WAIT0";
mcasp1.MCASP.ACLKX.$assign                     = "GPMC0_BE0n_CLE";
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@", mcasp1.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@", mcasp1.MCASP, "$assign");

mcspi1.$name                           = "CONFIG_MCSPI0";
mcspi1.mcspiChannel[0].$name           = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].MCU_CSn.$assign = "MCU_SPI0_CS1";

mcspi2.$name                   = "CONFIG_MCSPI1";
mcspi2.useMcuDomainPeripherals = false;
mcspi2.pinMode                 = 3;
mcspi2.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH1";
mcspi2.SPI.$assign             = "SPI2";

uart1.$name                = "CONFIG_UART0";
uart1.MCU_UART.$assign     = "MCU_USART0";
uart1.MCU_UART.RXD.$assign = "MCU_UART0_RXD";
uart1.MCU_UART.TXD.$assign = "MCU_UART0_TXD";

uart2.$name                      = "CONFIG_UART1";
uart2.useMcuDomainPeripherals    = false;
uart2.useWakeupDomainPeripherals = true;
uart2.WKUP_UART.$assign          = "WKUP_USART0";
uart2.WKUP_UART.RXD.$assign      = "WKUP_UART0_RXD";
uart2.WKUP_UART.TXD.$assign      = "WKUP_UART0_TXD";

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
udma1.$name        = "CONFIG_UDMA0";
mcasp1.bcDmaDriver = udma1;

debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;
debug_log.enableCssLog         = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio2.GPIO.$suggestSolution              = "GPIO1";
gpio3.GPIO.$suggestSolution              = "GPIO1";
gpio6.GPIO.$suggestSolution              = "GPIO1";
gpio7.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio8.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio9.GPIO.$suggestSolution              = "GPIO0";
gpio14.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio34.GPIO.$suggestSolution             = "GPIO0";
gpio41.GPIO.gpioPin.$suggestSolution     = "RGMII2_TD3";
gpio50.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio50.MCU_GPIO.gpioPin.$suggestSolution = "MCU_SPI0_CS0";
gpio51.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio52.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio53.GPIO.$suggestSolution             = "GPIO0";
gpio54.GPIO.$suggestSolution             = "GPIO0";
gpio55.GPIO.$suggestSolution             = "GPIO0";
mcasp1.SYSTEM.$suggestSolution           = "SYSTEM0";
mcspi1.MCU_SPI.$suggestSolution          = "MCU_SPI0";
mcspi1.MCU_SPI.CLK.$suggestSolution      = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$suggestSolution       = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$suggestSolution       = "MCU_SPI0_D1";
mcspi2.SPI.CLK.$suggestSolution          = "MCASP0_ACLKR";
mcspi2.SPI.D0.$suggestSolution           = "MCASP0_AXR3";
mcspi2.SPI.D1.$suggestSolution           = "MCASP0_AXR2";
